api/services/ApiService.php

SELECT EXISTS(SELECT * FROM "author" WHERE "author"."login"='login779667682')
SELECT * FROM "author" WHERE "login"='login779667682'
INSERT INTO "author" ("login") VALUES ('login779667682') RETURNING "id"
---
    public function addPost($title, $text, $login, $ip)
    {
        $authorModel = Author::find()->where(['login' => $login])->one();

        if (is_null($authorModel)) {
            $authorModel = new Author();
            $authorModel->login = $login;

            if (!$authorModel->save()) {

SELECT "post"."title", "post"."text" FROM "post" INNER JOIN "rating" ON "post".id = "rating".post_id GROUP BY "post"."id" ORDER BY AVG("rating".value) DESC LIMIT 10
---
    public function getTopPosts()
    {
        $postTable = Post::tableName();
        $ratingTable = Rating::tableName();

        $query = new Query();

        $posts = $query->select($postTable . '.title, ' . $postTable . '.text')
            ->from('post')
            ->join('INNER JOIN', $ratingTable, $postTable . '.id = ' . $ratingTable . '.post_id')
            ->groupBy($postTable . '.id')
            ->orderBy('AVG(' . $ratingTable . '.value) DESC')
            ->limit(10)
            ->all();

SELECT "post"."ip_author", "author"."login" FROM "post" INNER JOIN "author" ON "post".author_id = "author".id GROUP BY "post"."ip_author", "author"."login"
---
    public function getMultipleIpAuthors()
    {
        $postTable = Post::tableName();
        $authorTable = Author::tableName();

        $query = new Query();

        $models = $query->select($postTable . '.ip_author, ' . $authorTable . '.login')
            ->from($postTable)
            ->join('INNER JOIN', $authorTable, $postTable . '.author_id = ' . $authorTable . '.id')
            ->groupBy($postTable . '.ip_author, ' . $authorTable . '.login')
            ->all();

SELECT AVG(value) FROM "rating" WHERE "post_id"='21712'
---
    private function getAverageRate($postId)
    {
        return round(Rating::find()->where(['post_id' => $postId])->average('value'), 2);